PushPillServer/app/controllers/user/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."authentication_token" = ? LIMIT 1  [["authentication_token", "DfU4bivQ5XZv4GxBsyY2"]]
UPDATE "users" SET "authentication_token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["authentication_token", "6QuGd1tsNrGzjVoT5PSd"], ["updated_at", "2016-04-18 08:27:11.337047"], ["id", 1]]
---
  def destroy
    user = User.find_by_authentication_token(params[:auth_token])
    if user
      user.authentication_token = nil
      user.save!