PushPillServer/app/controllers/api/doctor_controller.rb

SELECT  "doctors".* FROM "doctors" WHERE "doctors"."authentication_token" = ? LIMIT 1  [["authentication_token", "xF2x8YaXHwJsxXG15KK5"]]
---
  def set_doctor
    @doctor = Doctor.find_by_authentication_token(params[:token])