PushPillServer/app/controllers/api/patients_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."doctor_id" = ? AND (id = '1')  ORDER BY "users"."id" ASC LIMIT 1  [["doctor_id", 1]]
---
  def show
    @patient = @doctor.users.where('id = ?', params[:id]).first

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "users" SET "doctor_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["doctor_id", 1], ["updated_at", "2016-04-19 13:04:36.775461"], ["id", 2]]
---
  def create
    @patient = User.find_by_id(params[:user_id])
    logger.debug @doctor
    @patient.doctor_id = @doctor.id
    @patient.save!

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 0]]
UPDATE "users" SET "doctor_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["doctor_id", nil], ["updated_at", "2016-04-19 13:12:01.354354"], ["id", 2]]
---
  def destroy
    @patient = User.find_by_id(params[:id])
    @patient.doctor_id = nil
    @patient.save!

SELECT  "doctors".* FROM "doctors" WHERE "doctors"."authentication_token" = ? LIMIT 1  [["authentication_token", "xF2x8YaXHwJsxXG15KK5"]]
---
  def set_doctor
    @doctor = Doctor.find_by_authentication_token(params[:token])