PushPillServer/app/controllers/api/pills_controller.rb

SELECT  "pills".* FROM "pills" WHERE "pills"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @pill = Pill.find_by_id(params[:id])

INSERT INTO "pills" ("name", "days_of_week", "notes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", ""], ["days_of_week", ""], ["notes", ""], ["created_at", "2016-04-19 04:48:06.813803"], ["updated_at", "2016-04-19 04:48:06.813803"]]
---
  def create
    @pill = Pill.new(pill_params)

    if @pill.save

SELECT  "pills".* FROM "pills" WHERE "pills"."id" = ? LIMIT 1  [["id", 7]]
---
  def edit
    @pill = Pill.find_by_id(params[:id])

SELECT  "pills".* FROM "pills" WHERE "pills"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "pills" SET "name" = ?, "days_of_week" = ?, "updated_at" = ? WHERE "pills"."id" = ?  [["name", "AF"], ["days_of_week", ""], ["updated_at", "2016-04-19 13:36:34.916671"], ["id", 7]]
---
  def update
    @pill = Pill.find_by_id(params[:id])

    if @pill.update(pill_params)

SELECT  "pills".* FROM "pills" WHERE "pills"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "pills" WHERE "pills"."id" = ?  [["id", 1]]
---
  def destroy
    @pill = Pill.find_by_id(params[:id])
    @pill.destroy

SELECT  "pills".* FROM "pills" WHERE "pills"."id" = ? LIMIT 1  [["id", 46]]
UPDATE "pills" SET "checked" = ?, "updated_at" = ? WHERE "pills"."id" = ?  [["checked", "t"], ["updated_at", "2016-04-21 08:18:45.263617"], ["id", 46]]
---
  def check
    @pill = Pill.find_by_id(params[:id])
    @pill.checked = true
    @pill.save!