PushPillServer/app/controllers/api/user_controller.rb

SELECT "users".* FROM "users" WHERE (doctor_id IS NULL)
---
  def patients
    @users = User.where('doctor_id IS NULL')

SELECT  "users".* FROM "users" WHERE "users"."authentication_token" = ? LIMIT 1  [["authentication_token", "6QuGd1tsNrGzjVoT5PSd"]]
---
  def show
    @user = User.find_by_authentication_token(params[:token])