PushPillServer/app/controllers/admin/users_controller.rb

  def index
    @users = User.paginate(page: params[:page], per_page: 10)
---
SELECT  "users".* FROM "users" LIMIT 10 OFFSET 0

  def show
    @user = User.find_by_id(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

  def push
    @user = User.find_by_id(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]